In [1]:
import pandas as pd
#series operations

In [12]:
a=pd.Series([1,2,3,5,2])

In [14]:
a.mean()

np.float64(2.6)

In [15]:
a.sum()

np.int64(13)

In [16]:
a.min()

np.int64(1)

In [17]:
a.values

array([1, 2, 3, 5, 2])

In [18]:
a.size

5

In [13]:
a.sort_values()

0    1
1    2
4    2
2    3
3    5
dtype: int64

In [27]:
se=pd.read_csv("D://pandas//nupu.csv")

In [28]:
se

   Unnamed: 0  stu_id stu_name  semster        dept       stu_city
0           0       1   chirag        1          it           kota
1           1       2     riya        2          cs      indergarh
2           2       3    nupur        3        data         jaipur
3           3       4     diya        4          cs           anta
4           4       5  kashish        5  networking  ramganjmanedi
5           5       6   chelsi        1        data           dudu
6           6       7     arun        2  Networking          dausa
7           7       8    lalit        3          cs  sawaimadhopur
8           8       9     ashu        4          it        neemuch
9           9      10   ananya        5       cloud          ajmer

In [31]:
se.values

array([[0, 1, 'chirag', 1, 'it', 'kota'],
       [1, 2, 'riya', 2, 'cs', 'indergarh'],
       [2, 3, 'nupur', 3, 'data', 'jaipur'],
       [3, 4, 'diya', 4, 'cs', 'anta'],
       [4, 5, 'kashish', 5, 'networking', 'ramganjmanedi'],
       [5, 6, 'chelsi', 1, 'data', 'dudu'],
       [6, 7, 'arun', 2, 'Networking', 'dausa'],
       [7, 8, 'lalit', 3, 'cs', 'sawaimadhopur'],
       [8, 9, 'ashu', 4, 'it', 'neemuch'],
       [9, 10, 'ananya', 5, 'cloud', 'ajmer']], dtype=object)

In [32]:
se.size

60

In [38]:
p=se.sort_values(by='semster')

In [39]:
p

   Unnamed: 0  stu_id stu_name  semster        dept       stu_city
0           0       1   chirag        1          it           kota
5           5       6   chelsi        1        data           dudu
6           6       7     arun        2  Networking          dausa
1           1       2     riya        2          cs      indergarh
7           7       8    lalit        3          cs  sawaimadhopur
2           2       3    nupur        3        data         jaipur
3           3       4     diya        4          cs           anta
8           8       9     ashu        4          it        neemuch
4           4       5  kashish        5  networking  ramganjmanedi
9           9      10   ananya        5       cloud          ajmer

In [41]:
se.sort_index()

   Unnamed: 0  stu_id stu_name  semster        dept       stu_city
0           0       1   chirag        1          it           kota
1           1       2     riya        2          cs      indergarh
2           2       3    nupur        3        data         jaipur
3           3       4     diya        4          cs           anta
4           4       5  kashish        5  networking  ramganjmanedi
5           5       6   chelsi        1        data           dudu
6           6       7     arun        2  Networking          dausa
7           7       8    lalit        3          cs  sawaimadhopur
8           8       9     ashu        4          it        neemuch
9           9      10   ananya        5       cloud          ajmer

In [42]:
d=se.rename(columns={'semster':'updatedsem'})

In [46]:
d

   Unnamed: 0  stu_id stu_name  updatedsem        dept       stu_city
0           0       1   chirag           1          it           kota
1           1       2     riya           2          cs      indergarh
2           2       3    nupur           3        data         jaipur
3           3       4     diya           4          cs           anta
4           4       5  kashish           5  networking  ramganjmanedi
5           5       6   chelsi           1        data           dudu
6           6       7     arun           2  Networking          dausa
7           7       8    lalit           3          cs  sawaimadhopur
8           8       9     ashu           4          it        neemuch
9           9      10   ananya           5       cloud          ajmer

In [49]:
import pandas as pd

In [50]:
d[stu_id]=d[stu_id].astype(float)

NameError: name 'stu_id' is not defined